<?php

$regions = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Касимов', 'Скопин', 'Сасово', 'Ряжск'],
    'Тульская область' => ['Тула', 'Новомосковск', 'Алексин', 'Щёкино', 'Ефремов'],
    "Тюменская область" => ["Тюмень", "Тобольск", "Ишим", "Ялуторовск", "Заводоуковск"],
];

foreach ($regions as $region => $cities) {
    echo "$region:\n";
    echo implode(', ', $cities) . ".\n";
}

